test_bench/cceh_buflog_12.log
key trace size: 50000000
------------------------------------------------
HashType:              CCEH buflog
Init Capacity:         16777216
Entries:               50000000
Trace size:            50000000
Read:                  1000000 
Write:                 1000000 
Thread:                12 
Report interval:       0 s
Stats interval:        10000000 records
benchmarks:            load,readrandom
------------------------------------------------
Start IPMWatcher for load
thread 11, between 45833326 - 49999992
thread  2, between 8333332 - 12499998
thread  7, between 29166662 - 33333328
thread  4, between 16666664 - 20833330
thread  1, between 4166666 - 8333332
thread  6, between 24999996 - 29166662
thread 10, between 41666660 - 45833326
thread  5, between 20833330 - 24999996
thread  3, between 12499998 - 16666664
thread  8, between 33333328 - 37499994
thread  9, between 37499994 - 41666660
thread  0, between 0 - 4166666
load         :       0.178 micros/op 5.364615 Mops/s;
DIMM0 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.46 |         6.90 |  14.50 | 475.21 |
DIMM1 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |       8787.96 |        4310.29 |    19206.48 |     11622.75 |   2.19 |   2.70 |
DIMM2 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.44 |         6.90 |  14.00 | 475.29 |
DIMM3 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.48 |         6.93 |  15.28 | 477.08 |
DIMM4 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.47 |         6.92 |  14.75 | 476.05 |
DIMM5 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.45 |         6.90 |  14.18 | 475.06 |
*SUM* | DIMM-R:  2160.9 MB/s. User-R:   988.6 MB/s   | DIMM-W:  1311.4 MB/s, User-W:   484.9 MB/s. Time:   8.89s.
App Read:  8788.1 MB, Raw Read: 19208.8 MB, App Write:  4310.4 MB, Raw Write: 11657.3 MB
Destroy IPMWatcher.

Start IPMWatcher for readrandom
readrandom   :       0.155 micros/op 6.162830 Mops/s; (num: 1000000, not find: 1)
DIMM0 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.10 |         1.56 |   3.25 | 107.63 |
DIMM1 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |       3269.98 |         413.91 |     6927.31 |      1669.61 |   2.12 |   4.03 |
DIMM2 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.10 |         1.56 |   3.26 | 107.63 |
DIMM3 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.11 |         1.57 |   3.59 | 108.27 |
DIMM4 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.10 |         1.56 |   3.26 | 107.68 |
DIMM5 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.10 |         1.56 |   3.22 | 107.73 |
*SUM* | DIMM-R:  3729.6 MB/s. User-R:  1760.5 MB/s   | DIMM-W:   903.0 MB/s, User-W:   222.9 MB/s. Time:   1.86s.
App Read:  3270.1 MB, Raw Read:  6927.8 MB, App Write:   414.0 MB, Raw Write:  1677.4 MB
Destroy IPMWatcher.