test_bench/cceh_buflog_16.log
key trace size: 50000000
------------------------------------------------
HashType:              CCEH buflog
Init Capacity:         16777216
Entries:               50000000
Trace size:            50000000
Read:                  1000000 
Write:                 1000000 
Thread:                16 
Report interval:       0 s
Stats interval:        10000000 records
benchmarks:            load,readrandom
------------------------------------------------
Start IPMWatcher for load
thread 13, between 40625000 - 43750000
thread 11, between 34375000 - 37500000
thread 15, between 46875000 - 50000000
thread  2, between 6250000 - 9375000
thread 10, between 31250000 - 34375000
thread  3, between 9375000 - 12500000
thread  0, between 0 - 3125000
thread  7, between 21875000 - 25000000
thread  5, between 15625000 - 18750000
thread  4, between 12500000 - 15625000
thread 12, between 37500000 - 40625000
thread  6, between 18750000 - 21875000
thread  8, between 25000000 - 28125000
thread  1, between 3125000 - 6250000
thread 14, between 43750000 - 46875000
thread  9, between 28125000 - 31250000
load         :       0.176 micros/op 5.410622 Mops/s;
DIMM0 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.45 |         6.86 |  14.32 | 472.03 |
DIMM1 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |       8171.27 |        4313.23 |    18073.29 |     12036.97 |   2.21 |   2.79 |
DIMM2 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.44 |         6.86 |  13.88 | 472.27 |
DIMM3 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.48 |         6.89 |  15.22 | 474.35 |
DIMM4 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.45 |         6.86 |  14.22 | 472.27 |
DIMM5 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.44 |         6.86 |  14.04 | 472.24 |
*SUM* | DIMM-R:  2050.7 MB/s. User-R:   927.1 MB/s   | DIMM-W:  1369.5 MB/s, User-W:   489.4 MB/s. Time:   8.81s.
App Read:  8171.4 MB, Raw Read: 18075.6 MB, App Write:  4313.3 MB, Raw Write: 12071.3 MB
Destroy IPMWatcher.

Start IPMWatcher for readrandom
readrandom   :       0.153 micros/op 6.235063 Mops/s; (num: 1000000, not find: 1)
DIMM0 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.13 |         2.00 |   4.15 | 138.00 |
DIMM1 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |       4268.97 |         529.08 |     9059.59 |      2131.42 |   2.12 |   4.03 |
DIMM2 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.13 |         2.01 |   4.08 | 138.08 |
DIMM3 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.14 |         2.01 |   4.30 | 138.17 |
DIMM4 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.13 |         2.00 |   4.11 | 137.87 |
DIMM5 | Read from IMC | Write from IMC |  Read DIMM  |  Write DIMM  |   RA   |   WA   |
  MB  |          0.03 |           0.01 |        0.13 |         2.01 |   4.14 | 138.08 |
*SUM* | DIMM-R:  3701.2 MB/s. User-R:  1744.0 MB/s   | DIMM-W:   874.8 MB/s, User-W:   216.2 MB/s. Time:   2.45s.
App Read:  4269.1 MB, Raw Read:  9060.2 MB, App Write:   529.2 MB, Raw Write:  2141.4 MB
Destroy IPMWatcher.